export interface cat {
  id: number;
  bleed: {
    eng: string;
    th: string;
  };
  locate: {
    eng: string;
    th: string;
  };
  general_nature: {
    info: string;
    img: string;
  };
  general_character: {
    info: string;
    img: string;
  };
  husbandry: string;
  derivation: string;
  img: Array<string>;
}

const cats: Array<cat> = [
  {
    id: 1,
    bleed: {
      eng: 'Persian',
      th: 'เปอร์เซีย ',
    },
    img: ['persian/01.png', 'persian/02.png', 'persian/03.png'],
    locate: {
      eng: 'Persia,Iran',
      th: 'เปอร์เซีย,อิหร่าน',
    },
    general_nature: {
      info: 'มีขนาดกลางถึงขนาดใหญ่ มีกระดูกที่ใหญ่และแข็งแรง หน้าผากโหนก แก้มเต็ม ดวงตากลมโต จมูกหัก มองจากด้านข้างจะเห็นจุดหักระหว่างจมูกกับหน้าผากชัดเจน เมื่อมองจากด้านหน้าจะเห็นเป็นขีดอยู่ระหว่างดวงตา',
      img: '',
    },
    general_character: {
      info: 'มีอุปนิสัยอ่อนโยน เข้ากับคนอื่นได้ง่าย มีความร่าเริงซุกซน ช่างประจบประแจง และเป็นแมวที่มีไหวพริบมาก',
      img: '',
    },
    husbandry:
      'จะต้องดูแลเรื่องขนเป็นพิเศษ แปรงขน เช็ดหน้า และคราบน้ำตาทุกวัน ',
    derivation:
      'แมวเปอร์เซีย เป็นราชินีแมวจากแดนตะวันออกกลาง มีถิ่นกำเนิดอยู่ในแถบเปอร์เซีย หรือประเทศตุรกีกับอิหร่าน เป็นแมวต่างประเทศสายพันธุ์แรกที่ถูกนำเข้ามาในประเทศไทย พันธุ์นี้เป็นที่นิยมในหมู่คนรักแมว หน้าตาน่าเอ็นดู ขนปุกปุย นิสัยน่ารักมาก ๆ ',
  },
  {
    id: 1,
    bleed: {
      eng: 'Persian',
      th: 'เปอร์เซีย ',
    },
    img: ['persian/01.png', 'persian/02.png', 'persian/03.png'],
    locate: {
      eng: 'Persia,Iran',
      th: 'เปอร์เซีย,อิหร่าน',
    },
    general_nature: {
      info: 'มีขนาดกลางถึงขนาดใหญ่ มีกระดูกที่ใหญ่และแข็งแรง หน้าผากโหนก แก้มเต็ม ดวงตากลมโต จมูกหัก มองจากด้านข้างจะเห็นจุดหักระหว่างจมูกกับหน้าผากชัดเจน เมื่อมองจากด้านหน้าจะเห็นเป็นขีดอยู่ระหว่างดวงตา',
      img: '',
    },
    general_character: {
      info: 'มีอุปนิสัยอ่อนโยน เข้ากับคนอื่นได้ง่าย มีความร่าเริงซุกซน ช่างประจบประแจง และเป็นแมวที่มีไหวพริบมาก',
      img: '',
    },
    husbandry:
      'จะต้องดูแลเรื่องขนเป็นพิเศษ แปรงขน เช็ดหน้า และคราบน้ำตาทุกวัน ',
    derivation:
      'แมวเปอร์เซีย เป็นราชินีแมวจากแดนตะวันออกกลาง มีถิ่นกำเนิดอยู่ในแถบเปอร์เซีย หรือประเทศตุรกีกับอิหร่าน เป็นแมวต่างประเทศสายพันธุ์แรกที่ถูกนำเข้ามาในประเทศไทย พันธุ์นี้เป็นที่นิยมในหมู่คนรักแมว หน้าตาน่าเอ็นดู ขนปุกปุย นิสัยน่ารักมาก ๆ ',
  },
  {
    id: 1,
    bleed: {
      eng: 'Persian',
      th: 'เปอร์เซีย ',
    },
    img: ['persian/01.png', 'persian/02.png', 'persian/03.png'],
    locate: {
      eng: 'Persia,Iran',
      th: 'เปอร์เซีย,อิหร่าน',
    },
    general_nature: {
      info: 'มีขนาดกลางถึงขนาดใหญ่ มีกระดูกที่ใหญ่และแข็งแรง หน้าผากโหนก แก้มเต็ม ดวงตากลมโต จมูกหัก มองจากด้านข้างจะเห็นจุดหักระหว่างจมูกกับหน้าผากชัดเจน เมื่อมองจากด้านหน้าจะเห็นเป็นขีดอยู่ระหว่างดวงตา',
      img: '',
    },
    general_character: {
      info: 'มีอุปนิสัยอ่อนโยน เข้ากับคนอื่นได้ง่าย มีความร่าเริงซุกซน ช่างประจบประแจง และเป็นแมวที่มีไหวพริบมาก',
      img: '',
    },
    husbandry:
      'จะต้องดูแลเรื่องขนเป็นพิเศษ แปรงขน เช็ดหน้า และคราบน้ำตาทุกวัน ',
    derivation:
      'แมวเปอร์เซีย เป็นราชินีแมวจากแดนตะวันออกกลาง มีถิ่นกำเนิดอยู่ในแถบเปอร์เซีย หรือประเทศตุรกีกับอิหร่าน เป็นแมวต่างประเทศสายพันธุ์แรกที่ถูกนำเข้ามาในประเทศไทย พันธุ์นี้เป็นที่นิยมในหมู่คนรักแมว หน้าตาน่าเอ็นดู ขนปุกปุย นิสัยน่ารักมาก ๆ ',
  },
  {
    id: 2,
    img: ['USAshorthair/01.png', 'USAshorthair/02.png', 'USAshorthair/03.png'],
    bleed: {
      eng: 'American Shorthair',
      th: 'อเมริกัน ชอร์ตแฮร์ ',
    },
    locate: {
      eng: 'United States',
      th: 'สหรัฐอเมริกา',
    },
    general_nature: {
      info: 'เป็นแมวที่ช่างสงสัย นิสัยร่าเริง ชอบเล่น มีเสน่ห์ฝึกค่อนข้างยาก เจ้าของควรจะคลุกคลีและอยู่กับแมวให้มาก ๆ มีสัญชาตญาณการเป็นนักล่า ชอบไล่จับแมลง และมองดูนก  ',
      img: '',
    },
    general_character: {
      info: 'มีขนาดกลางไปจนถึงขนาดใหญ่ โครงสร้างลำตัวโต มีกล้ามเนื้อแข็งแรง มองเห็นชัดเจน อกใหญ่ ขาใหญ่ ใบหูมีขอบเป็นทรงกลมมน ส่วนหัวมีลักษณะรูปไข่ ดวงตากลมโตเป็นสีเขียวมรกต มีลักษณะสีขน และรูปร่างมากกว่า 80 แบบ',
      img: '',
    },
    husbandry: 'ควรจะแปรงขนบ่อย ๆ และควรควบคุมน้ำหนัก ไม่ให้เกินมาตรฐาน',
    derivation:
      'แมวอเมริกัน ชอร์ตแฮร์  เป็นแมวสายพันธุ์อเมริกาที่สืบเชื้อสายมาจากประเทศในแถบยุโรป แพร่พันธุ์มายังอเมริกา เป็นแมวพื้นเมืองขนสั้นของอเมริกา ',
  },
  {
    id: 3,
    img: [''],
    bleed: {
      eng: 'Exotic',
      th: 'เอ็กโซติก',
    },
    locate: {
      eng: 'สหรัฐอเมริกา',
      th: 'United States',
    },
    general_nature: {
      info: 'มีลักษณะคล้ายคลึงกับแมวเปอร์เซีย แต่ลักษณะจุดเด่นคือ เป็นแมวหัวกลม ตาโต กะโหลกใหญ่ ใบหูกลมเล็ก จมูกหัก หน้าแบน ขนสั้นแต่หนาแน่นนุ่มคล้ายกำมะหยี่',
      img: '',
    },
    general_character: {
      info: 'มีนิสัยน่ารัก ขี้เล่น ซื่อสัตย์ต่อเจ้าของ และอดทนได้ดี อยู่กับคนได้ อยู่ตัวเดียวได้ นอกจากนี้ยังรักความเงียบสงบ ไม่ค่อยส่งเสียงร้อง ป็นแมวที่มีความสุภาพ อ่อนโยน ไม่ค่อยหงุดหงิด และมีความอดทนสูง',
      img: '',
    },
    husbandry:
      'ดูแลง่ายกว่าเปอร์เซียโดยไม่ต้องทำความสะอาดขนบ่อยๆ แต่ก็ต้องหมั่นทำความสะอาดเช็ดคราบน้ำตา ที่เหลือก็เลี้ยงง่าย ดูแลไม่ยาก แค่จัดสภาพแวดล้อมให้เหมาะสม ก็ไม่ต้องทุ่มเทให้เวลามาก',
    derivation:
      'เป็นแมวหน้าบูด จมูกหัก ขนนุ่ม สืบเชื้อสายมาจากแมว 2 สายพันธุ์ ระหว่างแมวเปอร์เซียกับแมวอเมริกัน ชอร์ตแฮร์',
  },
  {
    id: 4,
    img: [''],
    bleed: {
      eng: '',
      th: '',
    },
    locate: {
      eng: '',
      th: '',
    },
    general_nature: {
      info: '',
      img: '',
    },
    general_character: {
      info: '',
      img: '',
    },
    husbandry: '',
    derivation: '',
  },
  {
    id: 5,
    img: [''],
    bleed: {
      eng: '',
      th: '',
    },
    locate: {
      eng: '',
      th: '',
    },
    general_nature: {
      info: '',
      img: '',
    },
    general_character: {
      info: '',
      img: '',
    },
    husbandry: '',
    derivation: '',
  },
];

export { cats };
