export interface knowlage {
  id: number;
  head: string;
  content: string;
  img: string;
}

export const knowlage_list: Array<knowlage> = [
  {
    id: 1,
    head: 'แมวมีเซนส์อันยอดเยี่ยมเกี่ยวกับเรื่องแผ่นดินไหว',
    content:
      'เนื่องจากใต้อุ้งเท้าของแมวค่อนข้างเซนซิทีฟ ดังนั้นแมวทุกตังจึงสามารถรู้ล่วงหน้าได้ว่า จะมีแผ่นดินไหวเกิดขึ้นหรือไม่อย่างไร ส่วนคุณเองก็สามารถรับรู้ได้เช่นกัน โดยสังเกตได้จากพฤติกรรมแปลก ๆ หรือแตกต่างออกไปจากเดิมนั่นเอง และด้วยเหตุนี้เองจึงทำให้มีคนบางกลุ่มใช้อุ้งเท้าแมวในการหาค้นหาเหตุแผ่นดินไหวจากแรงสะเทือนด้วย',
    img: '',
  },
  {
    id: 2,
    head: 'แมวไม่เข้าใจการโดนลงโทษ',
    content:
      'การโดนลงโทษไม่มีผลใด ๆ กับแมวเลย เพราะแมวไม่มีทางเข้าใจสิ่งที่คุณทำ ดังนั้นถ้าหากคุณต้องการฝึกแมวให้ทำตามคำสั่ง ก็ควรสอนด้วยความอดทน คำชม และตอบแทนด้วยรางวัล ก็จะเห็นผลลัพธ์ที่ดีกว่า',
    img: '',
  },
  {
    id: 3,
    head: 'แมวก็มีฝันเหมือนกัน',
    content:
      'ความฝัน มักจะเกิดขึ้นเมื่อแมวอยู่ในภาวะผ่อนคลาย และสบายตัวมากพอที่จะทำให้พวกมันหลับลึก โดยในช่วงดังกล่าวแมวจะมีการสร้างรูปแบบของคลื่นสมองแบบเดียวกันกับเวลาที่คนกำลังฝันนั่นเอง',
    img: '',
  },
  {
    id: 4,
    head: 'แมวเป็นนายที่แท้จริงของบ้าน',
    content:
      'เพราะแมวสามารถเปล่งโทนเสียงเพื่อใช้ควบคุมพฤติกรรมของคนได้ อย่างเช่น ในเวลาที่แมวต้องการจะกินอาหาร มันก็จะใช้โทนเสียงที่ฟังคล้าย ๆ กับเสียงร้องไห้ออกมา เพื่อเป็นการกระตุ้นคุณให้เอาอาหารให้มันเร็วขึ้น เป็นต้น',
    img: '',
  },
  {
    id: 5,
    head: '',
    content: '',
    img: '',
  },
  {
    id: 2,
    head: '',
    content: '',
    img: '',
  },
  {
    id: 2,
    head: '',
    content: '',
    img: '',
  },
  {
    id: 2,
    head: '',
    content: '',
    img: '',
  },
];
